ConfigFiles/InformationRegisters/ПриоритетыВыполненияОбработчиковОбновления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПриоритетыВыполненияОбработчиковОбновления</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПорядокПомещенияВОчередь</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокПомещенияОбработчиковВОчередь</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаПовторнойЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОсобогоПорядкаРазработкиОбработчиковОбновления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовторнаяЗаписьОбъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокОтличаетсяОтДефолтного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗаписываетсяВФорме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Обработчик1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбработчикиОбновленияИнформационнойБазы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обработчик2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбработчикиОбновленияИнформационнойБазы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ConfigFiles/Enums/ПорядокПомещенияОбработчиковВОчередь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПорядокПомещенияОбработчиковВОчередь</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеобходимАнализ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НужноПеределатьОбработчики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СначалаОбработчик1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СначалаОбработчик2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсеРавноВКакойПоследовательности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НетПроблемы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/InformationRegisters/ПриоритетыВыполненияОбработчиковОбновления/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	РегистрыСведений.ПриоритетыВыполненияОбработчиковОбновления.РасчитатьПорядокОтличаетсяОтДефолтного(ТекущийОбъект);
	ТекущийОбъект.ЗаписываетсяВФорме = Истина;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Обработчик1", Запись.Обработчик1);
	ПараметрыОповещения.Вставить("Обработчик2", Запись.Обработчик2);
	ПараметрыОповещения.Вставить("ПорядокПомещенияВОчередь", Запись.ПорядокПомещенияВОчередь);
	
	Оповестить("Запись_ПриоритетыВыполненияОбработчиковОбновления", ПараметрыОповещения); 

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПорядокВыполненияОбработчиковОбновленияПриИзменении(Элемент)
	НастроитьФорму();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКонфликты

&НаКлиенте
Процедура КонфликтыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КонфликтыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	Проект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Обработчик1, "Владелец");
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(Запись.Обработчик1);
	СписокЗначений.Добавить(Запись.Обработчик2);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Конфликты,
																		"ОбработчикПисатель",
																		СписокЗначений,
																		ВидСравненияКомпоновкиДанных.ВСписке,
																		,
																		Истина);
																		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Конфликты,
																		"ОбработчикЧитательИлиПисатель",
																		СписокЗначений,
																		ВидСравненияКомпоновкиДанных.ВСписке,
																		,
																		Истина);
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Обработчик1, "МонопольныйРежимОправдан") Тогда
		Элементы.ПорядокВыполненияОбработчиковОбновления.СписокВыбора.Очистить();
		
		Элементы.ПорядокВыполненияОбработчиковОбновления.СписокВыбора.Добавить(Перечисления.ПорядокПомещенияОбработчиковВОчередь.НеобходимАнализ);
		Элементы.ПорядокВыполненияОбработчиковОбновления.СписокВыбора.Добавить(Перечисления.ПорядокПомещенияОбработчиковВОчередь.НужноПеределатьОбработчики);
		Элементы.ПорядокВыполненияОбработчиковОбновления.СписокВыбора.Добавить(Перечисления.ПорядокПомещенияОбработчиковВОчередь.НетПроблемы);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Запись.Обработчик1) Тогда
		КомментарийУстановлено = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Обработчик1, "КомментарийУстановлено");
		Элементы.Обработчик1.РасширеннаяПодсказка.Заголовок = КомментарийУстановлено;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Запись.Обработчик2) Тогда
		КомментарийУстановлено = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Обработчик2, "КомментарийУстановлено");
		Элементы.Обработчик2.РасширеннаяПодсказка.Заголовок = КомментарийУстановлено;
	КонецЕсли; 
	
	НастроитьФорму();	
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму()
	
	Элементы.ПричинаПовторнойЗаписиЗаголовок.Видимость = Запись.ПовторнаяЗаписьОбъекта;
	Элементы.ПричинаПовторнойЗаписи.Видимость          = Запись.ПовторнаяЗаписьОбъекта;
	
	
	НужнаПричина = Запись.ПорядокПомещенияВОчередь = Перечисления.ПорядокПомещенияОбработчиковВОчередь.ВсеРавноВКакойПоследовательности
					Или Запись.ПорядокПомещенияВОчередь = Перечисления.ПорядокПомещенияОбработчиковВОчередь.СначалаОбработчик1 
					Или Запись.ПорядокПомещенияВОчередь = Перечисления.ПорядокПомещенияОбработчиковВОчередь.СначалаОбработчик2 
					Или Запись.ПорядокПомещенияВОчередь = Перечисления.ПорядокПомещенияОбработчиковВОчередь.НетПроблемы; 
	
	Элементы.ПричинаПовторнойЗаписи.Доступность               = НужнаПричина;
	
КонецПроцедуры

#КонецОбласти
